; domain
;; Creation of signs from the wooden boards by the robotic hand
;; Author: Michal Sustr

(define (domain ROBOT)
	(:requirements :strips :typing)

	
	(:types board table shape color robot)

	(:predicates
		(isOnInputPile   ?board - board)
		(isCut 			 ?board - board)
		(isColored 		 ?board - board)
		(boardHasNoShape ?board - board)
		(boardHasShape 	 ?board - board ?shape - shape)
		(boardHasNoColor ?board - board)
		(boardHasColor   ?board - board ?color - color)
		(isOnOutputPile  ?board - board)

		(robotHasNoTool ?robot - robot)
		(robotHasSaw    ?robot - robot)
		(robotHasBrush  ?robot - robot)

		(robotIsBasic	 ?robot - robot)
		(robotIsAdvanced ?robot - robot)
		(robotIsExpert	 ?robot - robot)

		(boardIsLoaded		?board - board)
		(tableIsFree		?table - table)
		(boardLoadedOnTable ?board - board ?table - table)
	)

	(:functions
	   	(total-cost)
    )
  
;; ACTIONS
	(:action LOAD_BOARD_BASIC
		:parameters (?robot - robot ?board - board ?table - table)
		:precondition (and 
			(isOnInputPile ?board)
			(tableIsFree ?table)
			(robotHasNoTool ?robot)
			(robotIsBasic ?robot)
		)
		:effect (and 
			(not (tableIsFree ?table))
			(not (isOnInputPile ?board))
			(boardLoadedOnTable ?board ?table)
			(boardIsLoaded ?board)
			(increase (total-cost) 60)
		)
	)
	(:action LOAD_BOARD_ADVANCED
		:parameters (?robot - robot ?board - board ?table - table)
		:precondition (and 
			(isOnInputPile ?board)
			(tableIsFree ?table)
			(robotHasNoTool ?robot)
			(robotIsAdvanced ?robot)
		)
		:effect (and 
			(not (tableIsFree ?table))
			(not (isOnInputPile ?board))
			(boardLoadedOnTable ?board ?table)
			(boardIsLoaded ?board)
			(increase (total-cost) 45)
		)
	)
	(:action LOAD_BOARD_EXPERT
		:parameters (?robot - robot ?board - board ?table - table)
		:precondition (and 
			(isOnInputPile ?board)
			(tableIsFree ?table)
			(robotHasNoTool ?robot)
			(robotIsExpert ?robot)
		)
		:effect (and 
			(not (tableIsFree ?table))
			(not (isOnInputPile ?board))
			(boardLoadedOnTable ?board ?table)
			(boardIsLoaded ?board)
			(increase (total-cost) 30)
		)
	)

	(:action UNLOAD_BOARD_BASIC
		:parameters (?robot - robot ?board - board ?table - table)
		:precondition (and 
			(robotHasNoTool ?robot)
			(boardLoadedOnTable ?board ?table)
			(isCut ?board)
			(isColored ?board)
			(robotIsBasic ?robot)
		)
		:effect (and 
			(not (boardLoadedOnTable ?board ?table))
			(tableIsFree ?table)
			(not (boardIsLoaded ?board))
			(isOnOutputPile ?board)
			(increase (total-cost) 60)
		)
	)
	(:action UNLOAD_BOARD_ADVANCED
		:parameters (?robot - robot ?board - board ?table - table)
		:precondition (and 
			(robotHasNoTool ?robot)
			(boardLoadedOnTable ?board ?table)
			(isCut ?board)
			(isColored ?board)
			(robotIsAdvanced ?robot)
		)
		:effect (and 
			(not (boardLoadedOnTable ?board ?table))
			(tableIsFree ?table)
			(not (boardIsLoaded ?board))
			(isOnOutputPile ?board)
			(increase (total-cost) 45)
		)
	)
	(:action UNLOAD_BOARD_EXPERT
		:parameters (?robot - robot ?board - board ?table - table)
		:precondition (and 
			(robotHasNoTool ?robot)
			(boardLoadedOnTable ?board ?table)
			(isCut ?board)
			(isColored ?board)
			(robotIsExpert ?robot)
		)
		:effect (and 
			(not (boardLoadedOnTable ?board ?table))
			(tableIsFree ?table)
			(not (boardIsLoaded ?board))
			(isOnOutputPile ?board)
			(increase (total-cost) 30)
		)
	)

	(:action BRUSH_BOARD_BASIC
		:parameters (?robot - robot ?board - board ?color - color)
		:precondition (and 
			(robotHasBrush ?robot)
			(boardIsLoaded ?board)
			(boardHasNoColor ?board)
			(robotIsBasic ?robot)
		)
		:effect (and 
			(boardHasColor ?board ?color) 
			(isColored ?board)
			(not (boardHasNoColor ?board))
			(increase (total-cost) 180)
		)
	)
	(:action BRUSH_BOARD_ADVANCED
		:parameters (?robot - robot ?board - board ?color - color)
		:precondition (and 
			(robotHasBrush ?robot)
			(boardIsLoaded ?board)
			(boardHasNoColor ?board)
			(robotIsAdvanced ?robot)
		)
		:effect (and 
			(boardHasColor ?board ?color) 
			(isColored ?board)
			(not (boardHasNoColor ?board))
			(increase (total-cost) 135)
		)
	)
	(:action BRUSH_BOARD_EXPERT
		:parameters (?robot - robot ?board - board ?color - color)
		:precondition (and 
			(robotHasBrush ?robot)
			(boardIsLoaded ?board)
			(boardHasNoColor ?board)
			(robotIsExpert ?robot)
		)
		:effect (and 
			(boardHasColor ?board ?color) 
			(isColored ?board)
			(not (boardHasNoColor ?board))
			(increase (total-cost) 90)
		)
	)

	(:action CUT_BOARD_BASIC
		:parameters (?robot - robot ?board - board ?shape - shape)
		:precondition (and 
			(robotHasSaw ?robot)
			(boardHasNoShape ?board)
			(boardIsLoaded ?board)
			(robotIsBasic ?robot)
		)
		:effect (and 
			(boardHasShape ?board ?shape) 
			(not (boardHasNoShape ?board))
			(isCut ?board)
			(increase (total-cost) 120)
		)
	)
	(:action CUT_BOARD_ADVANCED
		:parameters (?robot - robot ?board - board ?shape - shape)
		:precondition (and 
			(robotHasSaw ?robot)
			(boardHasNoShape ?board)
			(boardIsLoaded ?board)
			(robotIsAdvanced ?robot)
		)
		:effect (and 
			(boardHasShape ?board ?shape) 
			(not (boardHasNoShape ?board))
			(isCut ?board)
			(increase (total-cost) 90)
		)
	)
	(:action CUT_BOARD_EXPERT
		:parameters (?robot - robot ?board - board ?shape - shape)
		:precondition (and 
			(robotHasSaw ?robot)
			(boardHasNoShape ?board)
			(boardIsLoaded ?board)
			(robotIsExpert ?robot)
		)
		:effect (and 
			(boardHasShape ?board ?shape) 
			(not (boardHasNoShape ?board))
			(isCut ?board)
			(increase (total-cost) 60)
		)
	)

	(:action TAKE_BRUSH
		:parameters (?robot - robot)
		:precondition (and 
			(robotHasNoTool ?robot)
		)
		:effect (and 
			(not (robotHasNoTool ?robot))
			(robotHasBrush ?robot)

			(increase (total-cost) 10)
		)
	)

	(:action TAKE_SAW
		:parameters (?robot - robot)
		:precondition (and 
			(robotHasNoTool ?robot)
		)
		:effect (and 
			(not (robotHasNoTool ?robot))
			(robotHasSaw ?robot)
			
			(increase (total-cost) 10)
		)
	)

	(:action LAY_BRUSH
		:parameters (?robot - robot)
		:precondition (and 
			(robotHasBrush ?robot)
		)
		:effect (and 
			(robotHasNoTool ?robot)
			(not (robotHasBrush ?robot))
			
			(increase (total-cost) 10)
		)
	)

	(:action LAY_SAW
		:parameters (?robot - robot)
		:precondition (and 
			(robotHasSaw ?robot)
		)
		:effect (and 
			(robotHasNoTool ?robot)
			(not (robotHasSaw ?robot))
			
			(increase (total-cost) 10)
		)
	)

	(:action UPGRADE_ADVANCED
		:parameters (?robot - robot)
		:precondition (and 
			(robotIsBasic ?robot)
		)
		:effect (and 
			(robotIsAdvanced ?robot)
			(not (robotIsBasic ?robot))
			(increase (total-cost) 200)
		)
	)


	(:action UPGRADE_EXPERT
		:parameters (?robot - robot)
		:precondition (and 
			(robotIsAdvanced ?robot)
		)
		:effect (and 
			(robotIsExpert ?robot)
			(not (robotIsAdvanced ?robot))
			(increase (total-cost) 350)
		)
	)
)

; problem
;; Creation of signs from the wooden boards by the robotic hand
;; Author: Michal Sustr

(define (problem ROBOTPROBLEM)
	(:domain ROBOT)
	(:objects 
	;; boards definitions
		b0 b1 b2 b3 - board
	;; shapes definitions
		triangle square circle hexagon - shape
	;; color definitions
		red blue yellow - color
	;; robots
		r - robot
	;; tables
		t1 t2 - table
	)

	(:init 
		(= (total-cost) 0)

	;; Initialize boards
		(isOnInputPile b0)	
		(isOnInputPile b1)
		(isOnInputPile b2)
		(isOnInputPile b3)


		(boardHasNoShape b0)
		(boardHasNoShape b1)
		(boardHasNoShape b2)
		(boardHasNoShape b3)

		(boardHasNoColor b0)
		(boardHasNoColor b1)
		(boardHasNoColor b2)
		(boardHasNoColor b3)

		(tableIsFree t1)
		(tableIsFree t2)
	;; Robot settings
		(robotHasNoTool r)
		(robotIsBasic   r)

	)

	(:goal (and 
		(isOnOutputPile b0)
		(isOnOutputPile b1)
		(isOnOutputPile b2)
		(isOnOutputPile b3)

		(boardHasShape b0 circle)
		(boardHasColor b0 red)
		(boardHasShape b1 triangle)
		(boardHasColor b1 yellow)
		(boardHasShape b2 square)
		(boardHasColor b2 yellow)
		(boardHasShape b3 square)
		(boardHasColor b3 yellow)
	))

	(:metric minimize (total-cost))
)

; plan
1. (load_board_basic r b3 t1)
   deleted: (tableisfree t1) (isoninputpile b3)
   added: (boardloadedontable b3 t1) (boardisloaded b3)
   goals met: 0 of 12
2. (load_board_basic r b2 t2)
   deleted: (tableisfree t2) (isoninputpile b2)
   added: (boardloadedontable b2 t2) (boardisloaded b2)
   goals met: 0 of 12
3. (take_saw r)
   deleted: (robothasnotool r)
   added: (robothassaw r)
   goals met: 0 of 12
4. (cut_board_basic r b3 square)
   deleted: (boardhasnoshape b3)
   added: (boardhasshape b3 square) (iscut b3)
   goals met: 1 of 12
5. (cut_board_basic r b2 square)
   deleted: (boardhasnoshape b2)
   added: (boardhasshape b2 square) (iscut b2)
   goals met: 2 of 12
6. (lay_saw r)
   deleted: (robothassaw r)
   added: (robothasnotool r)
   goals met: 2 of 12
7. (take_brush r)
   deleted: (robothasnotool r)
   added: (robothasbrush r)
   goals met: 2 of 12
8. (brush_board_basic r b3 yellow)
   deleted: (boardhasnocolor b3)
   added: (boardhascolor b3 yellow) (iscolored b3)
   goals met: 3 of 12
9. (brush_board_basic r b2 yellow)
   deleted: (boardhasnocolor b2)
   added: (boardhascolor b2 yellow) (iscolored b2)
   goals met: 4 of 12
10. (lay_brush r)
   deleted: (robothasbrush r)
   added: (robothasnotool r)
   goals met: 4 of 12
11. (unload_board_basic r b2 t2)
   deleted: (boardloadedontable b2 t2) (boardisloaded b2)
   added: (tableisfree t2) (isonoutputpile b2)
   goals met: 5 of 12
12. (unload_board_basic r b3 t1)
   deleted: (boardloadedontable b3 t1) (boardisloaded b3)
   added: (tableisfree t1) (isonoutputpile b3)
   goals met: 6 of 12
13. (load_board_basic r b1 t1)
   deleted: (tableisfree t1) (isoninputpile b1)
   added: (boardloadedontable b1 t1) (boardisloaded b1)
   goals met: 6 of 12
14. (load_board_basic r b0 t2)
   deleted: (tableisfree t2) (isoninputpile b0)
   added: (boardloadedontable b0 t2) (boardisloaded b0)
   goals met: 6 of 12
15. (take_saw r)
   deleted: (robothasnotool r)
   added: (robothassaw r)
   goals met: 6 of 12
16. (cut_board_basic r b1 triangle)
   deleted: (boardhasnoshape b1)
   added: (boardhasshape b1 triangle) (iscut b1)
   goals met: 7 of 12
17. (cut_board_basic r b0 circle)
   deleted: (boardhasnoshape b0)
   added: (boardhasshape b0 circle) (iscut b0)
   goals met: 8 of 12
18. (lay_saw r)
   deleted: (robothassaw r)
   added: (robothasnotool r)
   goals met: 8 of 12
19. (take_brush r)
   deleted: (robothasnotool r)
   added: (robothasbrush r)
   goals met: 8 of 12
20. (brush_board_basic r b1 yellow)
   deleted: (boardhasnocolor b1)
   added: (boardhascolor b1 yellow) (iscolored b1)
   goals met: 9 of 12
21. (brush_board_basic r b0 red)
   deleted: (boardhasnocolor b0)
   added: (boardhascolor b0 red) (iscolored b0)
   goals met: 10 of 12
22. (lay_brush r)
   deleted: (robothasbrush r)
   added: (robothasnotool r)
   goals met: 10 of 12
23. (unload_board_basic r b1 t1)
   deleted: (boardloadedontable b1 t1) (boardisloaded b1)
   added: (tableisfree t1) (isonoutputpile b1)
   goals met: 11 of 12
24. (unload_board_basic r b0 t2)
   deleted: (boardloadedontable b0 t2) (boardisloaded b0)
   added: (tableisfree t2) (isonoutputpile b0)
   goals met: 12 of 12
